# Tutorial: Encoding Categorical Variables

In [24]:
import pandas as pd

In [25]:
titanic_df = pd.read_csv("../datasets/titanic.csv", index_col=0)
titanic_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [27]:
titanic_df = titanic_df.drop(['Name', 'Cabin', 'Ticket'], axis = 1, errors='ignore')
titanic_df.head()

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                   0       3    male  22.0      1      0   7.2500        S
2                   1       1  female  38.0      1      0  71.2833        C
3                   1       3  female  26.0      0      0   7.9250        S
4                   1       1  female  35.0      1      0  53.1000        S
5                   0       3    male  35.0      0      0   8.0500        S

In [28]:
titanic_df_encode = pd.get_dummies(titanic_df, columns=["Sex"], drop_first=True)
titanic_df_encode

             Survived  Pclass   Age  SibSp  Parch     Fare Embarked  Sex_male
PassengerId
1                   0       3  22.0      1      0   7.2500        S         1
2                   1       1  38.0      1      0  71.2833        C         0
3                   1       3  26.0      0      0   7.9250        S         0
4                   1       1  35.0      1      0  53.1000        S         0
5                   0       3  35.0      0      0   8.0500        S         1
...               ...     ...   ...    ...    ...      ...      ...       ...
887                 0       2  27.0      0      0  13.0000        S         1
888                 1       1  19.0      0      0  30.0000        S         0
889                 0       3   NaN      1      2  23.4500        S         0
890                 1       1  26.0      0      0  30.0000        C         1
891                 0       3  32.0      0      0   7.7500        Q         1

[891 rows x 8 columns]

In [29]:
titanic_df_encode = pd.get_dummies(titanic_df_encode, columns=["Embarked"], drop_first=False)
titanic_df_encode

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,
1,0,3,22.0,1,0,7.2500,1,0,0,1
2,1,1,38.0,1,0,71.2833,0,1,0,0
3,1,3,26.0,0,0,7.9250,0,0,0,1
4,1,1,35.0,1,0,53.1000,0,0,0,1
5,0,3,35.0,0,0,8.0500,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...
887,0,2,27.0,0,0,13.0000,1,0,0,1
888,1,1,19.0,0,0,30.0000,0,0,0,1
889,0,3,NaN,1,2,23.4500,0,0,0,1
890,1,1,26.0,0,0,30.0000,1,1,0,0
891,0,3,32.0,0,0,7.7500,1,0,1,0

In [30]:
titanic_df_encode.values

array([[ 0.,  3., 22., ...,  0.,  0.,  1.],
       [ 1.,  1., 38., ...,  1.,  0.,  0.],
       [ 1.,  3., 26., ...,  0.,  0.,  1.],
       ...,
       [ 0.,  3., nan, ...,  0.,  0.,  1.],
       [ 1.,  1., 26., ...,  1.,  0.,  0.],
       [ 0.,  3., 32., ...,  0.,  1.,  0.]])